       01  SCIENTIFIC-DATA.
           05 TEMPERATURE           COMP-1.
           05 PRESSURE              COMP-2.
           05 HUMIDITY              PIC 9(3)V9(2).
