       01  MIXED-NUMBERS.
           05 DISPLAY-SIGNED        PIC S9(5).
           05 DISPLAY-UNSIGNED      PIC 9(5).
           05 BINARY-SIGNED         PIC S9(5) COMP.
           05 PACKED-SIGNED         PIC S9(5) COMP-3.
