       01  EMPLOYEE.
           05 ID                   PIC 9(6).
           05 DETAILS.
              10 NAME.
                 15 FIRST-NAME     PIC X(15).
                 15 LAST-NAME      PIC X(20).
              10 DETAILS.
                 15 DEPARTMENT     PIC X(10).
                 15 ROLE           PIC X(15).
