       01  FINANCIAL-VALUES.
           05 TAX-RATE              PIC S9(3)V9(3) COMP-3.
           05 DISCOUNT              PIC 9(1)V9(4) COMP-3.
           05 BALANCE               PIC S9(15) COMP-3.
